artem-sakhartchouk/wireless-optical-mouse-nrf52/usb_mouse.c
/******************************************************************************
 * USB String Descriptors
 ******************************************************************************/


#define USBD_STRING_LANG \
    0x04,         /* length of descriptor                   */\
    0x03,         /* descriptor type                        */\
    0x09,         /*                                        */\
    0x04          /* Supported LangID = 0x0409 (US-English) */





#define USBD_STRING_MANUFACTURER \
    42,           /* length of descriptor (? bytes)   */\
    0x03,         /* descriptor type                  */\
    'N', 0x00,    /* Define Unicode String "Nordic Semiconductor  */\
    'o', 0x00, \
    'r', 0x00, \
    'd', 0x00, \
    'i', 0x00, \
    'c', 0x00, \
    ' ', 0x00, \
    'S', 0x00, \
    'e', 0x00, \
    'm', 0x00, \
    'i', 0x00, \
    'c', 0x00, \
    'o', 0x00, \
    'n', 0x00, \
    'd', 0x00, \
    'u', 0x00, \
    'c', 0x00, \
    't', 0x00, \
    'o', 0x00, \
    'r', 0x00




#define USBD_STRING_PRODUCT \
    72,           /* length of descriptor (? bytes)         */\
    0x03,         /* descriptor type                        */\
    'n', 0x00,    /* generic unicode string for all devices */\
    'R', 0x00, \
    'F', 0x00, \
    '5', 0x00, \
    '2', 0x00, \
    ' ', 0x00, \
    'U', 0x00, \
    'S', 0x00, \
    'B', 0x00, \
    ' ', 0x00, \
    'H', 0x00, \
    'I', 0x00, \
    'D', 0x00, \
    ' ', 0x00, \
    'm', 0x00, \
    'o', 0x00, \
    'u', 0x00, \
    's', 0x00, \
    'e', 0x00, \
    ' ', 0x00, \
    'o', 0x00, \
    'n', 0x00, \
    ' ', 0x00, \
    'n', 0x00, \
    'r', 0x00, \
    'f', 0x00, \
    '_', 0x00, \
    'd', 0x00, \
    'r', 0x00, \
    'v', 0x00, \
    ' ', 0x00, \
    'D', 0x00, \
    'e', 0x00, \
    'm', 0x00, \
    'o', 0x00, \



static const uint8_t language_string_descriptor[] =
{
    USBD_STRING_LANG
};

static const uint8_t manufacturer_string_descriptor[] =
{
    USBD_STRING_MANUFACTURER
};

static const uint8_t product_string_descriptor[] =
{
    USBD_STRING_PRODUCT
};


/******************************************************************************
 * USB HID Descriptor
 ******************************************************************************/

#define USBD_HID0_DESCRIPTOR  \
    0x09,         /* bLength | length of descriptor (9 bytes)                    */\
    0x21,         /* bHIDDescriptor | descriptor type (HID)                      */\
    0x11, 0x01,   /* HID wBcdHID | Spec version 01.11                            */\
    0x00,         /* bCountryCode | HW Target country                            */\
    0x01,         /* bNumDescriptors | Number of HID class descriptors to follow */\
    0x22,         /* bDescriptorType | Report descriptor type is 0x22 (report)   */\
    (uint8_t)(USBD_MOUSE_REPORT_DESCRIPTOR_SIZE),      /* Total length of Report descr., low byte */ \
    (uint8_t)(USBD_MOUSE_REPORT_DESCRIPTOR_SIZE / 256) /* Total length of Report descr., high byte */





/******************************************************************************
 * USB Report Descriptor
 ******************************************************************************/

#define USBD_MOUSE_REPORT_DESCRIPTOR_SIZE  58

#define USBD_MOUSE_REPORT_DESCRIPTOR \
    0x05, 0x01,     /* Usage Page (Generic Desktop) */\
    0x09, 0x02,     /* Usage (Mouse) */\
    0xA1, 0x01,     /* Collection (Application) */\
    0x09, 0x01,     /* Usage (Pointer) */\
    0xA1, 0x00,     /* Collection (Physical) */\
\
    0x05, 0x09,     /* Usage Page (Buttons) */\
    0x19, 0x01,     /* Usage Minimum (1) */\
    0x29, 0x08,     /* Usage Maximum (8) */\
    0x15, 0x00,     /* Logical Minimum (0) */\
    0x25, 0x01,     /* Logical Maximum (1) */\
    0x95, 0x08,     /* Report Count (8) */\
    0x75, 0x01,     /* Report Size (1 bit) */\
    0x81, 0x02,     /* Input (Data, Variable, Absolute) */\
\
    0x05, 0x01,     /* Usage Page (Generic Desktop) */\
    0x16, 0x00, 0x80, /* Logical Minimum (-32768) */\
    0x26, 0xFF, 0x7F, /* Logical Maximum (32767) */\
    0x75, 0x10,     /* Report Size (16 bits) */\
    0x09, 0x30,     /* Usage (X) */\
    0x09, 0x31,     /* Usage (Y) */\
    0x95, 0x02,     /* Report Count (2) */\
    0x81, 0x06,     /* Input (Data, Variable, Relative) */\
\
    0x15, 0x81,     /* Logical Minimum (-127) */\
    0x25, 0x7F,     /* Logical Maximum (127) */\
    0x75, 0x08,     /* Report Size (8 bits) */\
    0x09, 0x38,     /* Usage (Wheel) */\
    0x95, 0x01,     /* Report Count (1) */\
    0x81, 0x06,     /* Input (Data, Variable, Relative) */\
\
    0xC0,           /* End Collection */\
    0xC0            /* End Collection */


#if 0
#define USBD_MOUSE_REPORT_DESCRIPTOR \
    0x05, 0x01,     /* usage page (generic desktop). Global item, applies to all subsequent items   */\
    0x09, 0x02,     /* usage (mouse). Local item                                                    */\
    0xA1, 0x01,     /* collection (application)                                                     */\
    0x09, 0x01,     /* usage (pointer)                                                              */\
    0xA1, 0x00,     /* collection (physical)                                                        */\
    0x05, 0x09,     /*   usage page (buttons). Global item, applies to all subsequent items         */\
    0x19, 0x01,     /*   usage minimum (1)                                                          */\
    0x29, 0x08,     /*   usage maximum (8)                                                          */\
    0x15, 0x00,     /*   logical minimum (0)                                                        */\
    0x25, 0x01,     /*   logical maximum (1)                                                        */\
    0x95, 0x08,     /*   report count (8)                                                           */\
    0x75, 0x01,     /*   report size (1)                                                            */\
    0x81, 0x02,     /*   input (data, var, abs)                                                     */\
    0x05, 0x01,     /*   usage page (generic desktop). Global item, applies to all subsequent items */\
    0x15, 0x81,     /*   logical minimum (-127)                                                     */\
    0x25, 0x7F,     /*   logical maximum (127)                                                      */\
    0x75, 0x08,     /*   report size (8)                                                            */\
    0x09, 0x30,     /*   usage (X)                                                                  */\
    0x09, 0x31,     /*   usage (Y)                                                                  */\
    0x09, 0x38,     /*   usage wheel                                                                */\
    0x95, 0x03,     /*   report count (3)                                                           */\
    0x81, 0x06,     /*   input (3 position bytes X, Y & roller)                                     */\
    0xC0,           /* end collection                                                               */\
    0xC0            /* End Collection                                                               */

#endif

static const uint8_t hid_report_descriptor[] =
{
    USBD_MOUSE_REPORT_DESCRIPTOR
}; 

static const uint8_t configuration_descriptor[] =
{
    USBD_CONFIG_DESCRIPTOR,
    USBD_INTERFACE0_DESCRIPTOR,
    USBD_HID0_DESCRIPTOR,
    USBD_ENDPOINT1_DESCRIPTOR
};

