artem-sakhartchouk/wireless-optical-mouse-nrf52/usb_mouse.c
/******************************************************************************
 * USB Control Response Data
 ******************************************************************************/


static const uint8_t configured_response[] = {1};
static const uint8_t unconfigured_response[] = {0};


static const uint8_t device_status[] =
{
    DEVICE_SELF_POWERED ? 0x01 : 0x00,
    0x00
};

static const uint8_t device_status_remote_wakeup[] =
{
    (DEVICE_SELF_POWERED ? 0x01 : 0x00) | 0x02,
    0x00
};




static const uint8_t interface_status[] = {0,0};

static const uint8_t endpoint_status_halted[] = {1,0};

static const uint8_t endpoint_status_active[] = {0,0};



/* Sizes of sub-descriptors within configuration descriptor */

#define CONFIG_DESCRIPTOR_SIZE      9
#define INTERFACE_DESCRIPTOR_SIZE   9
#define HID_DESCRIPTOR_SIZE         9
#define ENDPOINT_DESCRIPTOR_SIZE    7

_Static_assert(
    sizeof(configuration_descriptor) == USBD_CONFIG_DESCRIPTOR_FULL_SIZE,
    "Descriptor size mismatch!"
);

static const uint8_t * const interface_descriptor =
    &configuration_descriptor[9];

static const uint8_t * const hid_descriptor =
    &configuration_descriptor[9 + INTERFACE_DESCRIPTOR_SIZE];

static const uint8_t * const endpoint_descriptor =
    &configuration_descriptor[
        9 +
        INTERFACE_DESCRIPTOR_SIZE +
        HID_DESCRIPTOR_SIZE];



/******************************************************************************
 * USB Module State
 ******************************************************************************/

static volatile bool m_usbd_configured = false; //set if device is configured and ready to transmit data
static volatile bool m_usbd_suspended = false; //set if device suspended by host
static volatile bool m_usbd_rwu_enabled = false; //host can enable remote wakeup

static volatile bool m_usbd_suspend_state_req = false; //set if host wants to suspend the device

//static uint8_t m_previous_buttons; //global for storing incoming button states for click detect for usb rwu


static mouse_input_report_t m_current_report;

static bool m_current_report_valid = false; //


/******************************************************************************
 * USB Helper Functions
 ******************************************************************************/

static ret_code_t ep_configuration(uint8_t index)
{
    if ( index == 1 )
    {
        nrf_drv_usbd_ep_dtoggle_clear(NRF_DRV_USBD_EPIN1);
        nrf_drv_usbd_ep_stall_clear(NRF_DRV_USBD_EPIN1);
        nrf_drv_usbd_ep_enable(NRF_DRV_USBD_EPIN1);
        m_usbd_configured = true;
        led_on(LED_GREEN);
        //led_set_mode(LED_GREEN,LED_MODE_BLINK,500);
        //nrf_gpio_pin_clear(12); // force OFF when configured
        nrf_drv_usbd_setup_clear();
    }
    else if ( index == 0 )
    {
        nrf_drv_usbd_ep_disable(NRF_DRV_USBD_EPIN1);
        m_usbd_configured = false;
        nrf_drv_usbd_setup_clear();
    }
    else
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    return NRF_SUCCESS;
}


static void respond_setup_data(
    nrf_drv_usbd_setup_t const * const p_setup,
    void const * p_data, size_t size)
{
    /* Check the size against required response size */
    if (size > p_setup->wLength)
    {
        size = p_setup->wLength;
    }
    ret_code_t ret;
    nrf_drv_usbd_transfer_t transfer =
    {
        .p_data = {.tx = p_data},
        .size = size
    };
    ret = nrf_drv_usbd_ep_transfer(NRF_DRV_USBD_EPIN0, &transfer);
    if (ret != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("Transfer starting failed: %d", (uint32_t)ret);
    }
    ASSERT(ret == NRF_SUCCESS);
    UNUSED_VARIABLE(ret);
}


/******************************************************************************
 * USB Setup Request Handlers
 ******************************************************************************/

static void usbd_setup_GetStatus(nrf_drv_usbd_setup_t const * const p_setup)
{
    switch (p_setup->bmRequestType)
    {
    case 0x80: // Device
        if (((p_setup->wIndex) & 0xff) == 0)
        {
            respond_setup_data(
                p_setup,
                m_usbd_rwu_enabled ? device_status_remote_wakeup : device_status,
                sizeof(device_status));
            return;
        }
        break;
    case 0x81: // Interface
        if (m_usbd_configured) // Respond only if configured
        {
            if (((p_setup->wIndex) & 0xff) == 0) // Only interface 0 supported
            {
                respond_setup_data(
                    p_setup,
                    interface_status,
                    sizeof(interface_status));
                return;
            }
        }
        break;
    case 0x82: // Endpoint
        if (((p_setup->wIndex) & 0xff) == 0) // Endpoint 0
        {
            respond_setup_data(
                p_setup,
                endpoint_status_active,
                sizeof(endpoint_status_active));
            return;
        }
        if (m_usbd_configured) // Other endpoints responds if configured
        {
            if (((p_setup->wIndex) & 0xff) == NRF_DRV_USBD_EPIN1)
            {
                if (nrf_drv_usbd_ep_stall_check(NRF_DRV_USBD_EPIN1))
                {
                    respond_setup_data(
                        p_setup,
                        endpoint_status_halted,
                        sizeof(endpoint_status_halted));
                    return;
                }
                else
                {
                    respond_setup_data(
                        p_setup,
                        endpoint_status_active,
                        sizeof(endpoint_status_active));
                    return;
                }
            }
        }
        break;
    default:
        break; // Just go to stall
    }
    NRF_LOG_ERROR("Unknown status: 0x%2x", p_setup->bmRequestType);
    nrf_drv_usbd_setup_stall();
}



static void usbd_setup_ClearFeature(nrf_drv_usbd_setup_t const * const p_setup)
{
    if ((p_setup->bmRequestType) == 0x02) // standard request, recipient=endpoint
    {
        if ((p_setup->wValue) == 0)
        {
            if ((p_setup->wIndex) == NRF_DRV_USBD_EPIN1)
            {
                nrf_drv_usbd_ep_stall_clear(NRF_DRV_USBD_EPIN1);
                nrf_drv_usbd_setup_clear();
                return;
            }
        }
    }
    else if ((p_setup->bmRequestType) ==  0x0) // standard request, recipient=device
    {
        if (REMOTE_WU)
        {
            if ((p_setup->wValue) == 1) // Feature Wakeup
            {
                m_usbd_rwu_enabled = false;
                nrf_drv_usbd_setup_clear();
                return;
            }
        }
    }
    NRF_LOG_ERROR("Unknown feature to clear");
    nrf_drv_usbd_setup_stall();
}



