artem-sakhartchouk/wireless-optical-mouse-nrf52/usb_mouse.c
static void usbd_setup_SetInterface(nrf_drv_usbd_setup_t const * const p_setup)
{
    //no alternate setting is supported - STALL always
    NRF_LOG_ERROR("No alternate interfaces supported.");
    nrf_drv_usbd_setup_stall();
}


static void usbd_setup_SetProtocol(nrf_drv_usbd_setup_t const * const p_setup)
{
    if (p_setup->bmRequestType == 0x21)
    {
        //accept any value
        nrf_drv_usbd_setup_clear();
        return;
    }
    NRF_LOG_ERROR("Set Protocol wrong type: 0x%2x.", p_setup->bmRequestType);
    nrf_drv_usbd_setup_stall();
}


/******************************************************************************
 * USB Power Handler
 ******************************************************************************/

static void power_usb_event_handler(nrf_drv_power_usb_evt_t event)
{
    switch (event)
    {
    case NRF_DRV_POWER_USB_EVT_DETECTED:
        NRF_LOG_INFO("USB power detected");
        if (!nrf_drv_usbd_is_enabled())
        {
            nrf_drv_usbd_enable();
        }
        break;
    case NRF_DRV_POWER_USB_EVT_REMOVED:
        NRF_LOG_INFO("USB power removed");

        m_usbd_suspended = false;
        m_usbd_rwu_enabled = false;
        m_usbd_configured = false;
       

        if (nrf_drv_usbd_is_started())
        {
            nrf_drv_usbd_stop();
        }
        if (nrf_drv_usbd_is_enabled())
        {
            nrf_drv_usbd_disable();
        }
        /* Turn OFF LEDs */
        break;
    case NRF_DRV_POWER_USB_EVT_READY:
        NRF_LOG_INFO("USB ready");
        
        if (!nrf_drv_usbd_is_started())
        {
            nrf_drv_usbd_start(true);
        }
        break;
    default:
        ASSERT(false);
    }
}

/******************************************************************************
 * USB Mouse Globals
 ******************************************************************************/



//defines values for usb state to avoid data collision
typedef enum{
   USB_TX_IDLE,
   USB_TX_BUSY
}usb_tx_state_t;


typedef struct{ 
  usb_tx_state_t state; //IN ep status
  uint8_t buffer[8]; //global IN buffer
  uint8_t length; //length of data packet
  bool pending; //flag for new data
}usb_tx_ctx_t;


//global endpoint transfer struct instance
static usb_tx_ctx_t m_tx = 
{
    .state = USB_TX_IDLE,
    .length = 0,
    .pending = false
}; 


//hid mouse report definition
typedef struct __attribute__((packed))
{
    uint8_t buttons;
    int16_t x;
    int16_t y;
    int8_t wheel;
} hid_mouse_report_t;

_Static_assert(sizeof(hid_mouse_report_t) == 6,
               "Unexpected HID report size");

/******************************************************************************
 * Custom Helper Function
 ******************************************************************************/


//for converting usbd errors numbers to text identifiers
const char* usb_err_to_str(ret_code_t err)
{
    switch (err)
    {
        case NRF_SUCCESS: return "NRF_SUCCESS";
        case NRF_ERROR_BUSY: return "NRF_ERROR_BUSY";
        case NRF_ERROR_INVALID_STATE: return "NRF_ERROR_INVALID_STATE";
        case NRF_ERROR_NO_MEM: return "NRF_ERROR_NO_MEM";
        case NRF_ERROR_INVALID_PARAM: return "NRF_ERROR_INVALID_PARAM";
        default: return "UNKNOWN_ERROR";
    }
}


/******************************************************************************
 * USB Event Handlers
 ******************************************************************************/

//modular function that is called on SOF event interrupts, for consistent report timing
void usb_on_sof(void)
{
    if (!m_usbd_configured|| m_usbd_suspended) //abort if usbd not configured
        return;

    if (m_tx.pending && m_tx.state == USB_TX_IDLE)
    {
        
        nrfx_usbd_transfer_t transfer = {
            .p_data.tx =  m_tx.buffer,
            .size = m_tx.length,
            .flags = 0
        };


        ret_code_t err = nrfx_usbd_ep_transfer(
            NRF_DRV_USBD_EPIN1,
            &transfer
        );

        if (err == NRF_SUCCESS)
        {
            m_tx.state = USB_TX_BUSY;
            m_tx.pending = false;
        }
        else if (err == NRF_ERROR_INVALID_STATE)
        {
            m_tx.state = USB_TX_IDLE; // recover
        }
        else
        {
            printf("USB TX error: %s (%d)\n", usb_err_to_str(err), err);
            m_tx.state = USB_TX_IDLE;
        }
    }
}


 //usbd event handler
static void usbd_event_handler(nrf_drv_usbd_evt_t const * const p_event)
{
    switch (p_event->type)
    {


    case NRFX_USBD_EVT_SUSPEND:
    {
    
         m_usbd_suspended = true;

         /* Enter the USB low-power state required for remote wakeup. */
         (void)nrfx_usbd_suspend();

         break;
    }

    case NRFX_USBD_EVT_RESUME:
    case NRFX_USBD_EVT_WUREQ:
    {
    
        m_usbd_suspended = false;       
        break;
    }


    case NRF_DRV_USBD_EVT_RESET:
        {


            m_usbd_suspended = false;
            m_usbd_rwu_enabled = false;

            ret_code_t ret = ep_configuration(0);
            ASSERT(ret == NRF_SUCCESS);
            UNUSED_VARIABLE(ret);
            m_usbd_suspend_state_req = false;
            break;
        }
    case NRF_DRV_USBD_EVT_SOF:
        {


            if(!m_tx.pending && m_tx.state == USB_TX_IDLE)
            {
                mouse_input_report_t report;

                if(esb_mouse_rx_peek(&report))
                {
                    if(usb_mouse_send_report(
                        report.buttons,
                        report.x,
                        report.y,
                        0))
                    {
                        m_current_report = report;
                        m_current_report_valid = true;
                    }
                }
            }

            usb_on_sof();  
            break;
        }
    case NRF_DRV_USBD_EVT_EPTRANSFER:
        if (NRF_DRV_USBD_EPIN1 == p_event->data.eptransfer.ep)
        {


            if (NRF_USBD_EP_OK == p_event->data.eptransfer.status)
            {
                if (m_current_report_valid)
                {
                    esb_mouse_rx_commit(&m_current_report);
                    m_current_report_valid = false;
                }
            }
            else
            {
                NRF_LOG_WARNING(
                    "EPIN1 transfer failed or aborted: %d",
                    p_event->data.eptransfer.status
                    );
            }


