artem-sakhartchouk/wireless-optical-mouse-nrf52/usb_mouse.c
            m_tx.state = USB_TX_IDLE; //endpoint IN1 has successfully sent data to host and is available
            
        }
        else
        if (NRF_DRV_USBD_EPIN0 == p_event->data.eptransfer.ep)
        {
            if (NRF_USBD_EP_OK == p_event->data.eptransfer.status)
            {
                /* Transfer ok - allow status stage */
                nrf_drv_usbd_setup_clear();
            }
            else if (NRF_USBD_EP_ABORTED == p_event->data.eptransfer.status)
            {
                /* Just ignore */
                NRF_LOG_INFO("Transfer aborted event on EPIN0");
            }
            else
            {
                NRF_LOG_ERROR("Transfer failed on EPIN0: %d", p_event->data.eptransfer.status);
                nrf_drv_usbd_setup_stall();
            }
        }

        break;
    case NRF_DRV_USBD_EVT_SETUP:
        {
            nrf_drv_usbd_setup_t setup;
            nrf_drv_usbd_setup_get(&setup);
            switch (setup.bRequest)
            {
            case 0x00: // GetStatus
                usbd_setup_GetStatus(&setup);
                break;
            case 0x01: // CleartFeature
                usbd_setup_ClearFeature(&setup);
                break;
            case 0x03: // SetFeature
                usbd_setup_SetFeature(&setup);
                break;
            case 0x05: // SetAddress
                //nothing to do, handled by hardware; but don't STALL
                break;
            case 0x06: // GetDescriptor
                usbd_setup_GetDescriptor(&setup);
                break;
            case 0x08: // GetConfig
                usbd_setup_GetConfig(&setup);
                break;
            case 0x09: // SetConfig
                usbd_setup_SetConfig(&setup);
                break;
            //HID class
            case 0x0A: // SetIdle
                usbd_setup_SetIdle(&setup);
                break;
            case 0x0B: // SetProtocol or SetInterface
                if (setup.bmRequestType == 0x01) // standard request, recipient=interface
                {
                    usbd_setup_SetInterface(&setup);
                }
                else if (setup.bmRequestType == 0x21) // class request, recipient=interface
                {
                    usbd_setup_SetProtocol(&setup);
                }
                else
                {
                    NRF_LOG_ERROR("Command 0xB. Unknown request: 0x%2x", setup.bmRequestType);
                    nrf_drv_usbd_setup_stall();
                }
                break;
            default:
                NRF_LOG_ERROR("Unknown request: 0x%2x", setup.bRequest);
                nrf_drv_usbd_setup_stall();
                return;
            }
            break;
        }
    default:
        break;
    }
}


//initialize the usb device
void usb_mouse_init(void)
{
    ret_code_t ret;

    ret = nrf_drv_usbd_init(usbd_event_handler);

    APP_ERROR_CHECK(ret);

    nrf_drv_usbd_ep_max_packet_size_set(
        NRF_DRV_USBD_EPOUT0,
        EP0_MAXPACKETSIZE);

    nrf_drv_usbd_ep_max_packet_size_set(
        NRF_DRV_USBD_EPIN0,
        EP0_MAXPACKETSIZE);


    if (USBD_POWER_DETECTION)
    {
        static const nrf_drv_power_usbevt_config_t config =
        {
            .handler = power_usb_event_handler
        };

        ret = nrf_drv_power_usbevt_init(&config);
        APP_ERROR_CHECK(ret);
    }

    else
    {
        NRF_LOG_INFO("No USB power detection enabled\r\nStarting USB now");
        nrf_delay_us(STARTUP_DELAY);
        if (!nrf_drv_usbd_is_enabled())
        {
            nrf_drv_usbd_enable();
            ret = ep_configuration(0);
            APP_ERROR_CHECK(ret);
        }
        /* Wait for regulator power up */
        while (NRF_DRV_POWER_USB_STATE_CONNECTED
              ==
              nrf_drv_power_usbstatus_get())
        {
            /* Just waiting */
        }

        if (NRF_DRV_POWER_USB_STATE_READY == nrf_drv_power_usbstatus_get())
        {
            if (!nrf_drv_usbd_is_started())
            {
                nrf_drv_usbd_start(true);
            }
        }
        else
        {
            nrf_drv_usbd_disable();
        }
    }

}




//function called by the esb module when rx packet with motion payload arrives updates global mouse state struct 
static bool usb_mouse_send(const uint8_t *data, uint8_t length)
{
    if(length > sizeof(m_tx.buffer)) //might only be possible due to programming error. consider changing
    {
        return false;
    }

    //store data in global usbd buffer for IN ep transmission
    memcpy(m_tx.buffer, data, length);
    m_tx.length = length;
    m_tx.pending = true;

    return true;
}

/* Build and queue a HID report from the USB SOF path. */
bool usb_mouse_send_report(
    uint8_t buttons,
    int16_t x,
    int16_t y,
    int8_t wheel)
{



    //build hid report struct for usb transmission
    hid_mouse_report_t report =
    {
        .buttons = buttons,
        .x = x,
        .y = y,
        .wheel = wheel
    };

    //NRF_LOG_INFO("HID report size = %d", sizeof(report));
        
    //store new report to global usbd buffer
    bool accepted =  usb_mouse_send(
        (const uint8_t *)&report,
        sizeof(report));


    return accepted; //return true if report was successfully stored inside of the global buffer

}



/* Handle button wake requests independently of USB SOF events. */
void usb_mouse_remote_wakeup_process(void)
{
    bool wake_requested = esb_mouse_remote_wakeup_take();


    if (wake_requested &&
        m_usbd_configured &&
        m_usbd_suspended &&
        m_usbd_rwu_enabled)
    {
        (void)nrf_drv_usbd_wakeup_req();
    }
}

